config.el

(defun abs--quick-capture ()
       ;; redefine the function that splits the frame upon org-capture
       (defun abs--org-capture-place-template-dont-delete-windows (oldfun args)
         (cl-letf (((symbol-function 'org-switch-to-buffer-other-window) 'switch-to-buffer))
           (apply oldfun args)))

       ;; run-once hook to close window after capture
       (defun abs--delete-frame-after-capture ()
         (delete-frame)
         (remove-hook 'org-capture-after-finalize-hook 'abs--delete-frame-after-capture)
         )

       ;; set frame title
       (set-frame-name "emacs org capture")
       (add-hook 'org-capture-after-finalize-hook 'abs--delete-frame-after-capture)
       (abs--org-capture-place-template-dont-delete-windows 'org-capture nil)
  )

(use-package yequake
  :custom
  (yequake-frames
   '(("org-capture"
      (buffer-fns . (yequake-org-capture))
      (width . 0.75)
      (height . 0.5)
      (alpha . 0.95)
      (frame-parameters . ((undecorated . t)
                           (skip-taskbar . t)
                           (sticky . t)))))))

  (use-package org-pomodoro
    :config
    (setq org-pomodoro-length 25
          org-pomodoro-short-break-length 5
          org-pomodoro-long-break-length 30
          org-pomodoro-manual-break t
          org-pomodoro-clock-break nil
          org-pomodoro-play-sounds nil
          org-pomodoro-keep-killed-pomodoro-time t)

    (defun ed/toggle-music(action)
        (let ((command (concat "dbus-send --print-reply --dest=org.mpris.MediaPlayer2.spotify /org/mpris/MediaPlayer2 org.mpris.MediaPlayer2.Player." action)))
        (shell-command command)))

    (add-hook 'org-pomodoro-tick-hook
          '(lambda ()
            (shell-command (format "awesome-client 'screen[1].pomodoro:set_markup(\"%s\")'" (my/org-pomodoro-time)))))


    (add-hook 'org-pomodoro-started-hook
	      (apply-partially #'ed/toggle-music "Play"))

    (add-hook 'org-pomodoro-killed-hook
          '(lambda ()
            (ed/toggle-music "Pause")
            (shell-command (format "awesome-client 'screen[1].pomodoro:set_markup(\" <u>No Active task</u>\")'"))
            ))

    (add-hook 'org-pomodoro-overtime-hook
	      (apply-partially #'ed/toggle-music "Pause"))

    (add-hook 'org-pomodoro-finished-hook
	      (apply-partially #'ed/toggle-music "Pause"))
    )


 (defun my/org-pomodoro-time ()
  "Return the remaining pomodoro time"
  (if (org-pomodoro-active-p)
      (cl-case org-pomodoro-state
        (:pomodoro      (format " %d: %s - %s" org-pomodoro-count (org-pomodoro-format-seconds) (substring-no-properties org-clock-heading)))
        (:short-break   (format " Short break time: %s" (org-pomodoro-format-seconds)))
        (:long-break    (format " Long break time: %s" (org-pomodoro-format-seconds)))
        (:overtime      (format " <u>Overtime!</u> %s" (org-pomodoro-format-seconds))))
                        " <u>No Active task</u>"))
